trade/src/InformationRegisters/ТорговыеПредложенияТорговойПлощадки/ТорговыеПредложенияТорговойПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТорговыеПредложенияТорговойПлощадки</name>
  <comment>Служебные данные контроля изменений торговых предложений в сервисе 1С:Бизнес-сеть</comment>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Публикуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПредупреждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИсключенияИзПубликации</name>
    <type>
      <types>DefinedType.ПричинаИсключенияИзПубликацииТорговыеПредложения</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеПубликацииТорговыхПредложений</name>
    <type>
      <types>EnumRef.СостоянияПубликацииПозицииТорговогоПредложения</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РеквизитыПредупреждений</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХешИзображений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХешНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПрайсЛист</name>
    <type>
      <types>DefinedType.ТорговоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.НоменклатураБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатурыБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>DefinedType.УпаковкаНоменклатурыБЭД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ТорговыеПредложенияТорговойПлощадки/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновитьСтатистикуКоличестваОбъектовПоКатегориям(Замещение);
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗаписьНабора.КратностьУпаковки = 0 Тогда
			ЗаписьНабора.КратностьУпаковки = 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСтатистикуКоличестваОбъектовПоКатегориям(Замещение)

	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой") Тогда
		Возврат;
	ИначеЕсли ДополнительныеСвойства.Свойство("ОтключитьОбновлениеСтатистики") Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщийМодульРаботаСНоменклатуройСлужебный = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатуройСлужебный");
	ТаблицаОтличий = ТорговыеПредложенияСлужебный.ТаблицаОтличийДляСтатистики();
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ОтключитьПубликацию Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаОтличий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.Количество = 1;
	
	КонецЦикла; 
	
	Если ОбщегоНазначения.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
	
		ПредыдущийНаборЗаписей = РегистрыСведений.ТорговыеПредложенияТорговойПлощадки.СоздатьНаборЗаписей();
		
		Для каждого ЭлементОтбора Из Отбор Цикл
			ЗаполнитьЗначенияСвойств(ПредыдущийНаборЗаписей.Отбор[ЭлементОтбора.Имя], ЭлементОтбора);
		КонецЦикла;
		
		ПредыдущийНаборЗаписей.Прочитать();
		
		Для каждого Запись Из ПредыдущийНаборЗаписей Цикл
		
			Если Запись.ОтключитьПубликацию Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаОтличий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
			НоваяСтрока.Количество = -1;
		
		КонецЦикла; 
	
	КонецЕсли; 
	
	ОбщийМодульРаботаСНоменклатуройСлужебный.СкорректироватьСтатистику(ТаблицаОтличий);
	
КонецПроцедуры

#КонецОбласти

#Иначе
	
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
